Repository: asharov/penguz
Catalog: app/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Username
fi: Käyttäjätunnus

source: Email address
fi: Sähköpostiosoite

source: Full name
fi: Koko nimi

source: Nationality
fi: Kansalaisuus

source: Password
fi: Salasana

source: Confirm password
fi: Vahvista salasana

source: Request to be contest organizer
fi: Kilpailujärjestäjäpyyntö

source: Passwords do not match
fi: Salasanat eivät ole samat

source: Solution minimum length
fi: Ratkaisun minimipituus

source: Solution maximum length
fi: Ratkaisun maksimipituus

source: First allowed character
fi: Ensimmäinen sallittu merkki

source: Last allowed character
fi: Viimeinen sallittu merkki

source: Additional allowed characters
fi: Ylimääräiset sallitut merkit

source: No repetition
fi: Toisto kielletty

source: Minimum length must not be larger than maximum length
fi: Minimipituus ei saa olla maksimipituutta suurempi

source: First allowed character must come before the last allowed character
fi: Ensimmäisen sallitun merkin on tultava ennen viimeistä sallittua merkkiä

source: Contest name
fi: Kilpailun nimi

source: Description
fi: Kuvaus

source: Instruction booklet
fi: Ohjeet

source: Contest booklet
fi: Kilpailutehtävät

source: Contest start time
fi: Kilpailun alkamisaika

source: Contest end time
fi: Kilpailun päättymisaika

source: Contest duration in minutes
fi: Kilpailun kesto minuuteissa

source: Contest country (if applicable)
fi: Kilpailumaa (jos tarpeen)

source: Number of puzzles
fi: Tehtävien lukumäärä

source: Puzzle name
fi: Tehtävän nimi

source: Available points
fi: Saatavat pisteet

source: Solution
fi: Ratkaisu

source: Number of rows in solution
fi: Ratkaisun rivien määrä

source: Names of solution rows
fi: Ratkaisun rivien nimet

source: Username already exists
fi: Käyttäjätunnus on jo olemassa

source: Yes
fi: Kyllä

source: No
fi: Ei

source: You are not yet allowed to see the results of this contest
fi: Et saa vielä nähdä tämän kilpailun tuloksia

source: You are not allowed to edit this contest
fi: Et voi muokata tätä kilpailua

source: The page you tried to reach does not exist.
fi: Yritit mennä sivulle, jota ei ole olemassa.

source: Enter the data for each puzzle in the contest. Each row in a solution is entered separately by the contestant, but here the solution and row names need to be entered all together in a single field, separated by commas. Give descriptive names to the solution rows with correspondence to the puzzle, e.g., Row 5, Column 3.
fi: Syötä kunkin kilpailutehtävän tiedot. Kilpailijat syöttävät ratkaisun rivit erillisinä, mutta tässä lomakkeessa ratkaisu ja rivien nimet on syötettävä kaikki yhteen kenttään pilkuilla erotettuina. Muista antaa ratkaisun riveille tehtävään viittaavat nimet, esim. Rivi 5, Sarake 3.

source: The length, allowed characters, and repetition will be used to inform participants during the contest if their attempted answer has invalid form. They should therefore only contain constraints that are already evident from the puzzle instructions. The "First allowed character"-"Last allowed character" pair is for entering ranges, such as A-F or 1-9. "Additional allowed characters" can be used to allow characters outside the range, such as X or - to indicate an empty spot. Check the "No repetition" box if the form of the answer key ensures that all the characters are distinct, e.g., the numbers 1 to 9 in a classic sudoku.
fi: Ratkaisun pituutta, sallittuja merkkejä ja toistokieltoa käytetään kilpailun aikana kertomaan kilpailijalle, jos hänen yrittämänsä ratkaisu on virheellisen muotoinen, joten niiden tulisi aiheuttaa vain rajoitteita, jotka ovat ilmeisiä tehtävän ohjeesta. "Ensimmäinen sallittu merkki" ja "Viimeinen sallittu merkki" antavat merkkivälin kuten A-F tai 1-9. "Ylimääräiset sallitut merkit" antavat erilliset merkit, jotka voivat myös esiintyä ratkaisussa, kuten X tai - ilmaisemaan tyhjää kohtaa. Merkitse "Toisto kielletty", jos ratkaisun muoto takaa, että kaikki merkit ovat erilaisia, esim. numerot 1-9 klassisessa sudokussa.

source: Puzzle %(value)s
fi: Tehtävä %(value)s

source: Set puzzles
fi: Lisää tehtävät

source: Using a Javascript-capable browser and turning on Javascript is recommended, as then your remaining contest time is updated continuously, and some basic syntax checks are performed on your answers to eliminate certain typos. But Javascript is not necessary; you can participate fully in the contest without it enabled.
fi: On suositeltavaa käyttää selainta, joka tuntee Javascriptin, ja kääntää Javascript päälle. Tämä mahdollistaa jäljellä olevan ajan jatkuvan päivityksen ja vastausten etukäteistarkistuksen, joka merkitsee jotkin kirjoitusvirheet. Javascript ei kuitenkaan ole pakollinen; voit osallistua kilpailuun ilmankin.

source: The current server time is provided to help determine the exact hours of the contest period. It is not updated constantly, only on page refresh.
fi: Palvelimen aika auttaa määrittämään milloin varsinainen kilpailuaika on. Se päivittyy ainoastaan sivun uudelleenlatauksella.

source: Contest period starts
fi: Kilpailuaika alkaa

source: Contest period ends
fi: Kilpailuaika päättyy

source: Current server time
fi: Palvelimen aika nyt

source: Instructions
fi: Ohjeet

source: Instructions not yet available
fi: Ohjeet eivät ole vielä saatavilla

source: Contest booklet not yet available
fi: Kilpailutehtävät eivät ole vielä saatavilla

source: Will be revealed when you start
fi: Näytetään tässä aloitettuasi

source: Time remaining
fi: Jäljellä oleva aika

source: See the results
fi: Tulokset

source: You will need to <a href="%(login_url)s">log in</a> before you can start the contest. If you do not yet have an account on this site, you need to <a href="%(register_url)s">register first</a>.
fi: Sinun on <a href="%(login_url)s">kirjauduttava sisään</a> ennen kuin voit aloittaa kilpailun. Jos et ole vielä luonut itsellesi tunnusta tälle sivustolle, sinun on ensin <a href="%(register_url)s">rekisteröidyttävä</a>.

source: Contest over
fi: Kilpailu ohi

source: 1 answer submitted.
fi: 1 vastaus lähetetty.

source: Time of latest submission
fi: Viimeisimmän lähetyksen aika

source: Submit answers
fi: Lähetä vastaukset

source: Answer must be {0} characters long
fi: Vastauksen on oltava {0} merkkiä pitkä

source: Answer must be between {0} and {1} characters long
fi: Vastauksen on oltava {0}-{1} merkkiä pitkä

source: Allowed characters are {0}-{1} and {2}
fi: Sallitut merkit ovat {0}-{1} ja {2}

source: Allowed characters are {0}-{1}
fi: Sallitut merkit ovat {0}-{1}

source: Allowed characters are {0}
fi: Sallitut merkit ovat {0}

source: All characters must be different
fi: Kaikkien merkkien on oltava erilaisia

source: Start contest
fi: Aloita kilpailu

source: Enter the general new contest information here. The description, booklets, booklet password, and start and end times can be edited afterwards, other information will remain as you enter it now. Start and end times are entered in the format <tt>year-month-day hour:minute</tt>. If you wish participants from one country to be shown separately in the results (e.g., for national championships), set the country, otherwise leave it blank.
fi: Syötä uuden kilpailun yleiset tiedot. Vain kuvausta, ohjeita, kilpailutehtäviä ja alkamis- ja päättymisaikaa voi muokata myöhemmin. Alkamis- ja päättymisaika syötetään muodossa <tt>vuosi-kuukausi-päivä tunti:minuutti</tt>. Jos olet järjestämässä esim. kansallisia mestaruuskilpailuja, joissa yhden maan edustajat tarvitsee erotella tuloksissa, anna myös kilpailumaa.

source: The start and end times are determined based on the server time. The current server time is %(now)s.
fi: Alkamis- ja päättymisaika määräytyvät palvelimen ajan mukaan. Palvelimen aika nyt on %(now)s.

source: Create contest
fi: Luo kilpailu

source: Submit changes
fi: Lähetä muutokset

source: All the contests on this site have a common format. There is a contest booklet that is intended to be printed out, and each puzzle in it solved on paper. Each puzzle has an answer key, which is extracted from the solved puzzle and submitted on the contest page of the site. A separate instruction booklet can be downloaded in advance to see the types of puzzles in the contest and how the answer keys are formed. The actual contest booklet will also be available prior to the contest, but it is protected by a password to prevent contestants from seeing the puzzles in advance.
fi: Kilpailut tällä sivustolla noudattavat kaikki samaa kaavaa. Kilpailutehtävät ovat kilpailuvihkosessa, joka on tarkoitus tulostaa ja jokainen tehtävä ratkaista paperilla. Kullakin tehtävällä on ratkaisuavain, joka poimitaan ratkaistusta tehtävästä ja lähetetään kilpailun sivulla. Erillinen ohjevihkonen on saatavilla etukäteen ja sisältää tehtävätyypit sekä ohjeet kuinka ratkaisuavain muodostetaan ratkaistusta tehtävästä. Varsinainen kilpailuvihkonen on myös saatavilla ennen kilpailua, mutta se on suojattu salasanalla, jotta kilpailijat eivät näkisi tehtäviä etukäteen.

source: Each contest has a period during which it is available for solving, often around a few days. At any point during this time, a contestant may request the password for the contest booklet on the contest page, which starts the contest for that contestant. After starting, there is a specific time available for solving, usually on the order of a couple of hours. During this time, answer keys may be submitted for the puzzles, any number at a time and as many times as desired. Submissions are not accepted after the contest period ends, even if the contestant has not spent the whole allowed duration, so it is recommended to begin the contest well in advance of the period's end.
fi: Kullakin kilpailulla on kilpailuaika, jolloin se on saatavilla ratkaistavaksi, yleensä muutama päivä. Kilpailija voi koska tahansa tänä aikana hakea kilpailuvihkosen salasanan kilpailun sivulta, mikä aloittaa kilpailun. Tämän jälkeen kilpailun ratkontaan on käytettävissä tietty aika, yleensä parisen tuntia, minkä aikana tehtävien ratkaisuavaimet voi lähettää. Ratkaisuja voi lähettää yhden tai useampia kerrallaan ja niin monta kertaa kuin haluaa. Ratkaisuja ei hyväksytä kilpailuajan päättymisen jälkeen, vaikka kilpailija ei olisikaan käyttänyt kaikkea käytettävissä olevaa aikaa. On siis suositeltavaa aloittaa kilpailu hyvissä ajoin ennen kilpailuajan loppua.

source: Available contests
fi: Kilpailuluettelo

source: Welcome to this puzzle contest site. All the contests available on this site are listed below. See the <a href="%(help_url)s">Help page</a> for instructions on participating in the contests.
fi: Tervetuloa tälle puzzlekilpailusivustolle. Sivuston kilpailut on listattu alla. <a href="%(help_url)s">Ohjesivu</a> selostaa kilpailun kulun.

source: You need to be <a href="%(login_url)s">logged in</a> to participate in the contests.
fi: Sinun on <a href="%(login_url)s">kirjauduttava sisään</a> voidaksesi osallistua kilpailuihin.

source: There are currently no contests on this site.
fi: Tällä sivustolla ei ole yhtään kilpailua.

source: Current contests
fi: Käynnissä olevat kilpailut

source: Upcoming contests
fi: Tulossa olevat kilpailut

source: Past contests
fi: Päättyneet kilpailut

source: Own contests
fi: Omat kilpailut

source: These are all the contests you have participated in or have organized on this site.
fi: Nämä ovat kilpailut joihin olet osallistunut tai jotka olet järjestänyt tällä sivustolla.

source: Contests as participant
fi: Kilpailut osanottajana

source: Organized contests
fi: Kilpailut järjestäjänä

source: Edit contest
fi: Muokkaa kilpailua

source: Add puzzles
fi: Lisää tehtävät

source: Edit puzzles
fi: Muokkaa tehtäviä

source: My profile
fi: Omat tiedot

source: Log out
fi: Kirjaudu ulos

source: Log in
fi: Kirjaudu sisään

source: Register
fi: Rekisteröidy

source: Home
fi: Etusivu

source: My contests
fi: Omat kilpailut

source: Create a new contest
fi: Luo uusi kilpailu

source: Help
fi: Ohjeet

source: User profile
fi: Omat tiedot

source: Organizer
fi: Järjestäjä

source: Others
fi: Muut

source: Name
fi: Nimi

source: Country
fi: Maa

source: Email
fi: Sähköposti

source: Score
fi: Pisteet

source: Time
fi: Aika

source: Enter your username and password below. If you do not yet have an account on this site, you will need to <a href="%(register_url)s">register</a> first.
fi: Syötä käyttäjätunnuksesi ja salasanasi kirjautuaksesi sisään. Jos sinulla ei ole vielä tunnusta tällä sivustolla, sinun on ensin <a href="%(register_url)s">rekisteröidyttävä</a>.

source: Logging in uses cookies, so they need to be allowed for this site.
fi: Sisäänkirjautumisessa käytetään evästeitä, joten niiden tulee olla sallittuina tälle sivustolle.

source: Enter your information here. Your username and password are used to log in to the site. Your name and nationality will be displayed in the results table of the contests that you participate in, but neither is mandatory. Nationality is used to determine the proper results for contests such as national championships, so it should be the country you would represent at world championships. If you do not provide them, your username is used in place of your name, and your nationality is not displayed, Your email address will not be publicly visible, but it will be shown to the organizer of any contest you participate in, to enable them to contact you afterwards.
fi: Syötä omat tietosi tähän. Käyttäjätunnusta ja salasanaa käytetään kirjautumaan sisään sivustolle. Nimi ja kansalaisuus näytetään tuloksissa, jos osallistut kilpailuun, mutta kumpikaan ei ole pakollinen. Kansalaisuus merkitsee esim. kansallisissa mestaruuskilpailuissa, joten sen tulisi olla maa, jota edustat MM-kilpailuissa. Jos et anna näitä tietoja, käyttäjätunnustasi käytetään nimen paikalla tuloksissa, ja kansalaisuutta ei näytetä ollenkaan. Sähköpostiosoitteesi ei ole missään julkisesti näkyvillä, mutta se näytetään järjestäjälle, kun osallistut kilpailuun, jotta hän voi ottaa sinuun yhteyttä kilpailun jälkeen.

source: Logging in also uses cookies, so they need to be allowed for this site.
fi: Sisäänkirjautuminen myös käyttää evästeitä, joten niiden tulee olla sallittuina tälle sivustolle.

source: If you wish to organize contests on this site in addition to participating in them, check the box requesting to be an organizer. An administrator will, at some point after your registration, give you the appropriate access. When you have been given permission to organize contests, you will have an additional selection on the left-side menu to create a new contest.
fi: Jos haluat osallistumisen lisäksi myös järjestää kilpailuja tällä sivustolla, merkitse Kilpailujärjestäjäpyyntö-kohta, ja sivuston ylläpitäjä antaa sinulle tarvittavat oikeudet. Kun olet saanut luvan järjestää kilpailuja, vasemman laidan valikossa on mahdollisuus luoda uusi kilpailu.
